## Pandas

In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
my_dict = {"Dodo" : 24, "Fako" : 18, "Camfrog" : 70}

In [3]:
pd.Series(my_dict)

Dodo       24
Fako       18
Camfrog    70
dtype: int64

In [4]:
my_ages = [24, 18, 70]
my_names = ["Dodo", "Fako", "Camfrog"]

In [5]:
pd.Series(my_ages)

0    24
1    18
2    70
dtype: int64

In [6]:
pd.Series(my_ages, my_names)

Dodo       24
Fako       18
Camfrog    70
dtype: int64

In [7]:
pd.Series(data = my_ages, index = my_names )

Dodo       24
Fako       18
Camfrog    70
dtype: int64

In [8]:
numpy_array = np.array([10, 20, 30])

In [9]:
pd.Series(numpy_array)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(numpy_array, my_names)

Dodo       10
Fako       20
Camfrog    30
dtype: int32

### Properties of Series

In [12]:
pd.Series(["Atil", "Doruk", "Poseidon"],[1,2,3])

1        Atil
2       Doruk
3    Poseidon
dtype: object

In [13]:
end_results_1 =  pd.Series([300,200,100],["Atil", "Doruk", "Poseidon"])

In [14]:
end_results_2 = pd.Series([20,10,8],["Atil", "Doruk", "Poseidon"])

In [15]:
end_results_2

Atil        20
Doruk       10
Poseidon     8
dtype: int64

In [16]:
end_results_1

Atil        300
Doruk       200
Poseidon    100
dtype: int64

In [18]:
end_results_1["Doruk"]

200

In [19]:
end_results_2["Atil"]

20

In [21]:
final_results = end_results_1 + end_results_2

In [22]:
final_results

Atil        320
Doruk       210
Poseidon    108
dtype: int64

In [23]:
diff_series = pd.Series([20,30,40,50],["A", "B", "C", "D"])

In [24]:
diff_series_2 = pd.Series([5,1,3,5,6],["A", "E", "F", "G", "H"])

In [25]:
diff_series_2

A    5
E    1
F    3
G    5
H    6
dtype: int64

In [26]:
diff_series

A    20
B    30
C    40
D    50
dtype: int64

In [27]:
final_diff_series = diff_series + diff_series_2

In [28]:
final_diff_series

A    25.0
B     NaN
C     NaN
D     NaN
E     NaN
F     NaN
G     NaN
H     NaN
dtype: float64

## Data Frames

In [31]:
data = np.random.randn(4,3)

In [34]:
data_frame = pd.DataFrame(data)

In [36]:
data_frame

          0         1         2
0 -2.427331 -0.795932  0.702614
1  0.530926  0.380931 -2.248928
2 -1.268646  0.488851 -1.186052
3 -0.442976 -1.965793  0.660660

In [37]:
data_frame[0]

0   -2.427331
1    0.530926
2   -1.268646
3   -0.442976
Name: 0, dtype: float64

In [38]:
type(data_frame[0])

pandas.core.series.Series

In [40]:
new_data_frame = pd.DataFrame(data, index = ["Ali", "Beyza","Ceyhun","Deniz"], columns = ["Salary","Age","Working hours"])

In [41]:
new_data_frame

          Salary       Age  Working hours
Ali    -2.427331 -0.795932       0.702614
Beyza   0.530926  0.380931      -2.248928
Ceyhun -1.268646  0.488851      -1.186052
Deniz  -0.442976 -1.965793       0.660660

In [42]:
new_data_frame["Age"]

Ali      -0.795932
Beyza     0.380931
Ceyhun    0.488851
Deniz    -1.965793
Name: Age, dtype: float64

In [43]:
new_data_frame["Salary"]

Ali      -2.427331
Beyza     0.530926
Ceyhun   -1.268646
Deniz    -0.442976
Name: Salary, dtype: float64

In [45]:
new_data_frame[["Salary","Age"]]

          Salary       Age
Ali    -2.427331 -0.795932
Beyza   0.530926  0.380931
Ceyhun -1.268646  0.488851
Deniz  -0.442976 -1.965793

In [49]:
new_data_frame.loc["Ceyhun"] #index for Ceyhun

Salary          -1.268646
Age              0.488851
Working hours   -1.186052
Name: Ceyhun, dtype: float64

In [50]:
new_data_frame.iloc[2] #index for Ceyhun

Salary          -1.268646
Age              0.488851
Working hours   -1.186052
Name: Ceyhun, dtype: float64

In [54]:
new_data_frame["Retirement Age"] = new_data_frame["Age"] * 2

In [55]:
new_data_frame

          Salary       Age  Working hours  Retirment Age  Retirement Age
Ali    -2.427331 -0.795932       0.702614      -1.591864       -1.591864
Beyza   0.530926  0.380931      -2.248928       0.761862        0.761862
Ceyhun -1.268646  0.488851      -1.186052       0.977701        0.977701
Deniz  -0.442976 -1.965793       0.660660      -3.931585       -3.931585

In [60]:
new_data_frame.drop("Retirment Age", axis = 1)

          Salary       Age  Working hours  Retirement Age
Ali    -2.427331 -0.795932       0.702614       -1.591864
Beyza   0.530926  0.380931      -2.248928        0.761862
Ceyhun -1.268646  0.488851      -1.186052        0.977701
Deniz  -0.442976 -1.965793       0.660660       -3.931585

In [61]:
new_data_frame.drop("Deniz", axis = 0)

          Salary       Age  Working hours  Retirment Age  Retirement Age
Ali    -2.427331 -0.795932       0.702614      -1.591864       -1.591864
Beyza   0.530926  0.380931      -2.248928       0.761862        0.761862
Ceyhun -1.268646  0.488851      -1.186052       0.977701        0.977701

In [62]:
new_data_frame

          Salary       Age  Working hours  Retirment Age  Retirement Age
Ali    -2.427331 -0.795932       0.702614      -1.591864       -1.591864
Beyza   0.530926  0.380931      -2.248928       0.761862        0.761862
Ceyhun -1.268646  0.488851      -1.186052       0.977701        0.977701
Deniz  -0.442976 -1.965793       0.660660      -3.931585       -3.931585

In [63]:
new_data_frame.drop("Retirment Age", axis = 1, inplace = True)

In [64]:
new_data_frame

          Salary       Age  Working hours  Retirement Age
Ali    -2.427331 -0.795932       0.702614       -1.591864
Beyza   0.530926  0.380931      -2.248928        0.761862
Ceyhun -1.268646  0.488851      -1.186052        0.977701
Deniz  -0.442976 -1.965793       0.660660       -3.931585

In [65]:
new_data_frame.loc["Beyza"]["Age"]

0.38093123425006487

In [66]:
new_data_frame.loc["Ceyhun", "Retirement Age"]

0.9777011921785103

In [67]:
new_data_frame

          Salary       Age  Working hours  Retirement Age
Ali    -2.427331 -0.795932       0.702614       -1.591864
Beyza   0.530926  0.380931      -2.248928        0.761862
Ceyhun -1.268646  0.488851      -1.186052        0.977701
Deniz  -0.442976 -1.965793       0.660660       -3.931585

In [68]:
new_data_frame < 0

        Salary    Age  Working hours  Retirement Age
Ali       True   True          False            True
Beyza    False  False           True           False
Ceyhun    True  False           True           False
Deniz     True   True          False            True

In [70]:
boolean_frame = new_data_frame < 0

In [71]:
boolean_frame

        Salary    Age  Working hours  Retirement Age
Ali       True   True          False            True
Beyza    False  False           True           False
Ceyhun    True  False           True           False
Deniz     True   True          False            True

In [72]:
new_data_frame[boolean_frame]

          Salary       Age  Working hours  Retirement Age
Ali    -2.427331 -0.795932            NaN       -1.591864
Beyza        NaN       NaN      -2.248928             NaN
Ceyhun -1.268646       NaN      -1.186052             NaN
Deniz  -0.442976 -1.965793            NaN       -3.931585

In [77]:
new_data_frame["Age"] > 0

Ali       False
Beyza      True
Ceyhun     True
Deniz     False
Name: Age, dtype: bool

In [78]:
new_data_frame[new_data_frame["Age"] > 0]

          Salary       Age  Working hours  Retirement Age
Beyza   0.530926  0.380931      -2.248928        0.761862
Ceyhun -1.268646  0.488851      -1.186052        0.977701

In [79]:
new_data_frame[new_data_frame["Working hours"] > 0]

         Salary       Age  Working hours  Retirement Age
Ali   -2.427331 -0.795932       0.702614       -1.591864
Deniz -0.442976 -1.965793       0.660660       -3.931585

In [80]:
# How to change index of a data frame.

In [82]:
new_data_frame.reset_index()

    index    Salary       Age  Working hours  Retirement Age
0     Ali -2.427331 -0.795932       0.702614       -1.591864
1   Beyza  0.530926  0.380931      -2.248928        0.761862
2  Ceyhun -1.268646  0.488851      -1.186052        0.977701
3   Deniz -0.442976 -1.965793       0.660660       -3.931585

In [83]:
new_data_frame

          Salary       Age  Working hours  Retirement Age
Ali    -2.427331 -0.795932       0.702614       -1.591864
Beyza   0.530926  0.380931      -2.248928        0.761862
Ceyhun -1.268646  0.488851      -1.186052        0.977701
Deniz  -0.442976 -1.965793       0.660660       -3.931585

In [84]:
new_index_list = ["A", "B", "C", "D"]

In [85]:
new_data_frame["New Indexes"] = new_index_list

In [86]:
new_data_frame.set_index("New Indexes")

               Salary       Age  Working hours  Retirement Age
New Indexes
A           -2.427331 -0.795932       0.702614       -1.591864
B            0.530926  0.380931      -2.248928        0.761862
C           -1.268646  0.488851      -1.186052        0.977701
D           -0.442976 -1.965793       0.660660       -3.931585

In [87]:
new_data_frame

          Salary       Age  Working hours  Retirement Age New Indexes
Ali    -2.427331 -0.795932       0.702614       -1.591864           A
Beyza   0.530926  0.380931      -2.248928        0.761862           B
Ceyhun -1.268646  0.488851      -1.186052        0.977701           C
Deniz  -0.442976 -1.965793       0.660660       -3.931585           D

In [88]:
new_data_frame.set_index("New Indexes", inplace = True)

In [89]:
new_data_frame

               Salary       Age  Working hours  Retirement Age
New Indexes
A           -2.427331 -0.795932       0.702614       -1.591864
B            0.530926  0.380931      -2.248928        0.761862
C           -1.268646  0.488851      -1.186052        0.977701
D           -0.442976 -1.965793       0.660660       -3.931585

In [93]:
new_data_frame.loc["A"]

Salary           -2.427331
Age              -0.795932
Working hours     0.702614
Retirement Age   -1.591864
Name: A, dtype: float64

In [94]:
first_indexes = ["Simpsons", "Simpsons", "Simpsons", "South Park", "South Park", "South Park" ]

In [95]:
second_indexes = ["Homer", "Bart", "Marge", "Cartman", "Stan", "Kyle"]

In [97]:
compound_indexes = list(zip(first_indexes, second_indexes))

In [99]:
compound_indexes

[('Simpsons', 'Homer'),
 ('Simpsons', 'Bart'),
 ('Simpsons', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Stan'),
 ('South Park', 'Kyle')]

In [100]:
compound_indexes = pd.MultiIndex.from_tuples(compound_indexes)

In [101]:
compound_indexes

MultiIndex([(  'Simpsons',   'Homer'),
            (  'Simpsons',    'Bart'),
            (  'Simpsons',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',    'Stan'),
            ('South Park',    'Kyle')],
           )

In [102]:
cartoon_list = [[40, "A"],[10, "B"], [9, "C"], [9, "D"], [11, "F"], [9, "E"]]

In [103]:
cartoon_numpy_list = np.array(cartoon_list)

In [106]:
cartoon_data_frame = pd.DataFrame(cartoon_numpy_list, compound_indexes, ["Age", "Job"])

In [107]:
cartoon_data_frame

                   Age Job
Simpsons   Homer    40   A
           Bart     10   B
           Marge     9   C
South Park Cartman   9   D
           Stan     11   F
           Kyle      9   E

In [109]:
cartoon_data_frame.loc["South Park"]

        Age Job
Cartman   9   D
Stan     11   F
Kyle      9   E

In [111]:
cartoon_data_frame.loc["South Park"].loc["Stan"]

Age    11
Job     F
Name: Stan, dtype: object

In [114]:
cartoon_data_frame.index.names = ["Cartoon Name", "Name"]

In [115]:
cartoon_data_frame

                     Age Job
Cartoon Name Name
Simpsons     Homer    40   A
             Bart     10   B
             Marge     9   C
South Park   Cartman   9   D
             Stan     11   F
             Kyle      9   E

# Operations

## Missing Data

In [117]:
dict_info = {"Istanbul" : [30,29,np.nan], "Ankara" : [20, np.nan,25], "Izmir": [40,39,38] }
weather_data_frame = pd.DataFrame(dict_info)

In [118]:
weather_data_frame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [119]:
weather_data_frame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [120]:
weather_data_frame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [121]:
weather_data_frame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [124]:
new_dict_info = {"Istanbul" : [30,29,np.nan], "Ankara" : [20, np.nan,25], "Izmir": [40,39,38], "Antalya" : [np.nan, 36, np.nan] }
new_weather_data_frame = pd.DataFrame(new_dict_info)

In [125]:
new_weather_data_frame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40      NaN
1      29.0     NaN     39     36.0
2       NaN    25.0     38      NaN

In [126]:
new_weather_data_frame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [132]:
new_weather_data_frame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     20.0
1      29.0    20.0     39     36.0
2      20.0    25.0     38     20.0

## Groupby

In [133]:
# Groups rows, columns.

In [143]:
salary_dict = {"Departments" : ["Software", "HR", "Software", "Marketing", "HR", "Marketing"], "Employees" : ["A", "B", "C", "D", "E", "F"], "Salary" : [200, 300, 120, 399, 239, 450]}

In [144]:
salary_data_frame = pd.DataFrame(salary_dict)

In [145]:
salary_data_frame

  Departments Employees  Salary
0    Software         A     200
1          HR         B     300
2    Software         C     120
3   Marketing         D     399
4          HR         E     239
5   Marketing         F     450

In [146]:
group_object = salary_data_frame.groupby("Departments")

In [147]:
group_object.count()

             Employees  Salary
Departments
HR                   2       2
Marketing            2       2
Software             2       2

In [148]:
group_object.mean()

             Salary
Departments
HR            269.5
Marketing     424.5
Software      160.0

In [149]:
group_object.max()

            Employees  Salary
Departments
HR                  E     300
Marketing           F     450
Software            C     200

In [150]:
group_object.min()

            Employees  Salary
Departments
HR                  B     239
Marketing           D     399
Software            A     120

In [152]:
group_object.describe()

            Salary
             count   mean        std    min     25%    50%     75%    max
Departments
HR             2.0  269.5  43.133514  239.0  254.25  269.5  284.75  300.0
Marketing      2.0  424.5  36.062446  399.0  411.75  424.5  437.25  450.0
Software       2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0

## Working with Different Data Frames

In [153]:
# Ex: 3 different data frames.

In [158]:
sport_calorie_burns_1 = {"Name" : ["A", "B", "C", "D"], 
                                   "Sport" : ["Running", "Swimming", "Basketbol", "Swimming"],
                                   "Calories" : [100, 200, 300, 400]}
                                   
sport_calorie_burns_2 = {"Name" : ["E", "F", "G", "H"], 
                                   "Sport" : ["Running", "Swimming", "Basketbol", "Swimming"],
                                   "Calories" : [101, 210, 323, 460]}
sport_calorie_burns_3 = {"Name" : ["J", "K", "L", "M"], 
                                   "Sport" : ["Running", "Swimming", "Basketbol", "Swimming"],
                                   "Calories" : [130, 230, 330, 440]}

In [159]:
data_frame_1 = pd.DataFrame(sport_calorie_burns_1, index = [0,1,2,3])
data_frame_2 = pd.DataFrame(sport_calorie_burns_2, index = [4,5,6,7])
data_frame_3 = pd.DataFrame(sport_calorie_burns_3, index = [8,9,10,11])

In [161]:
data_frame_1

  Name      Sport  Calories
0    A    Running       100
1    B   Swimming       200
2    C  Basketbol       300
3    D   Swimming       400

In [162]:
data_frame_2

  Name      Sport  Calories
4    E    Running       101
5    F   Swimming       210
6    G  Basketbol       323
7    H   Swimming       460

In [163]:
data_frame_3

   Name      Sport  Calories
8     J    Running       130
9     K   Swimming       230
10    L  Basketbol       330
11    M   Swimming       440

##  concatenation

In [165]:
concatted_data_frame = pd.concat([data_frame_1, data_frame_2, data_frame_3], axis = 0)

In [166]:
concatted_data_frame

   Name      Sport  Calories
0     A    Running       100
1     B   Swimming       200
2     C  Basketbol       300
3     D   Swimming       400
4     E    Running       101
5     F   Swimming       210
6     G  Basketbol       323
7     H   Swimming       460
8     J    Running       130
9     K   Swimming       230
10    L  Basketbol       330
11    M   Swimming       440

## Merging / Merge

In [167]:
merge_dict_1 = {"Names" : ["A", "B", "C", "D"], "Sport" : ["Running", "Basketbol", "Running", "Swimming"]}
merge_dict_2 = {"Names" : ["A", "B", "C", "D"], "Calories" : [100, 200, 300, 400]}

In [168]:
merge_data_frame_1 = pd.DataFrame(merge_dict_1)
merge_data_frame_2 = pd.DataFrame(merge_dict_2)

In [169]:
merge_data_frame_1

  Names      Sport
0     A    Running
1     B  Basketbol
2     C    Running
3     D   Swimming

In [170]:
merge_data_frame_2

  Names  Calories
0     A       100
1     B       200
2     C       300
3     D       400

In [172]:
merged_data_frame = pd.merge(merge_data_frame_1,merge_data_frame_2, on = "Names")

In [173]:
merged_data_frame

  Names      Sport  Calories
0     A    Running       100
1     B  Basketbol       200
2     C    Running       300
3     D   Swimming       400

# Pandas Advanced Operations / Tips & Tricks

In [177]:
new_salary_dict = {"Names" : ["A", "B", "C", "D"], "Department" : ["Software", "Sales", "Bargain", "Software"], "Salary" : [200,300,350,250]}

In [178]:
new_salary_data_frame = pd.DataFrame(new_salary_dict)

In [179]:
new_salary_data_frame

  Names Department  Salary
0     A   Software     200
1     B      Sales     300
2     C    Bargain     350
3     D   Software     250

In [180]:
new_salary_data_frame["Department"].unique()

array(['Software', 'Sales', 'Bargain'], dtype=object)

In [182]:
new_salary_data_frame["Department"].nunique()

3

In [183]:
new_salary_data_frame["Department"].value_countsunts()

Software    2
Bargain     1
Sales       1
Name: Department, dtype: int64

In [184]:
def taxed_salary(salary):
    return salary * 0.66

In [188]:
new_salary_data_frame["Salary"].apply(taxed_salary)

0    132.0
1    198.0
2    231.0
3    165.0
Name: Salary, dtype: float64

In [189]:
new_salary_data_frame.isnull()

   Names  Department  Salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

In [199]:
new_data = {"Character Class" : ["South Park", "South Park", "Simpson" , "Simpson", "Simpson"],
           "Names" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
           "Ages" : [9, 9, 45, 11,11]}

In [200]:
char_DF = pd.DataFrame(new_data)

In [201]:
char_DF

  Character Class    Names  Ages
0      South Park  Cartman     9
1      South Park    Kenny     9
2         Simpson    Homer    45
3         Simpson     Bart    11
4         Simpson     Bart    11

In [202]:
char_DF.pivot_table(values = "Ages", index = ["Character Class", "Names"], aggfunc=np.sum)

                         Ages
Character Class Names
Simpson         Bart       22
                Homer      45
South Park      Cartman     9
                Kenny       9

## Using Excel Data

In [207]:
data_frame_excel = pd.read_excel("pandas_example.xlsx")

In [208]:
data_frame_excel

  Unnamed: 0  Salary   Age Department
0          A     100  23.0   Cleaning
1          B     200  25.0        NaN
2          C     300  28.0      Chief
3          D     230   NaN   Software
4          E     170  24.0         HR
5          F     200   NaN    Finance

In [210]:
non_empty_data_frame = data_frame_excel.dropna()

In [211]:
non_empty_data_frame

  Unnamed: 0  Salary   Age Department
0          A     100  23.0   Cleaning
2          C     300  28.0      Chief
4          E     170  24.0         HR

In [212]:
non_empty_data_frame.to_excel("new_pandas_example.xlsx")

In [213]:
#Created an excel file named "new_pandas_example.xlsx"
#if your file is in csv format use ".csv"

# End